---
kind: method
id: M:Autodesk.Revit.DB.TriangulatedShellComponent.Dispose
source: html/473c63e9-6ee4-e8a1-052c-c8c2cf8ad5b0.htm
---
# Autodesk.Revit.DB.TriangulatedShellComponent.Dispose Method

Releases all resources used by the TriangulatedShellComponent

## Syntax (C#)
```csharp
public void Dispose()
```